In [1]:
import pandas as pd
df_row = pd.read_csv('exam.csv')
df = df_row.head(10)
df

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

In [2]:
df['nclass']

0    1
1    1
2    1
3    1
4    2
5    2
6    2
7    2
8    3
9    3
Name: nclass, dtype: int64

In [3]:
# nclass가 1인지 확인
df['nclass'] == 1

0     True
1     True
2     True
3     True
4    False
5    False
6    False
7    False
8    False
9    False
Name: nclass, dtype: bool

In [4]:
# nclass가 1이면 추출
df[df['nclass'] == 1]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [5]:
# 수학 점수가 80점 이상이면 추출
df[df['math'] >= 80]

   id  nclass  math  english  science
6   7       2    80       90       45
7   8       2    90       78       25

In [6]:
# 1반이면서 수학 점수가 50점 이상
df[(df['nclass'] == 1) & (df['math'] >= 50)]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60

In [7]:
# 수학 점수가 50점 미만이거나 영어 점수가 50점 미만
df[(df['math'] < 50) | (df['english'] > 50)]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

In [8]:
df['id']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: id, dtype: int64

In [9]:
df['nclass']

0    1
1    1
2    1
3    1
4    2
5    2
6    2
7    2
8    3
9    3
Name: nclass, dtype: int64

In [10]:
df[['id', 'nclass']]

   id  nclass
0   1       1
1   2       1
2   3       1
3   4       1
4   5       2
5   6       2
6   7       2
7   8       2
8   9       3
9  10       3

In [11]:
# 시리즈로 추출
df['id']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: id, dtype: int64

In [12]:
# 데이터 프레임으로 추출
df[['id']]

   id
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [13]:
# []를 이용해 변수 추출
df['math']

0    50
1    60
2    45
3    30
4    25
5    50
6    80
7    90
8    20
9    50
Name: math, dtype: int64

In [14]:
# .을 이용해 변수 추출
df.math

0    50
1    60
2    45
3    30
4    25
5    50
6    80
7    90
8    20
9    50
Name: math, dtype: int64

In [15]:
df['math'].mean()
# 50

np.float64(50.0)

In [16]:
df.math.mean()
# 50

np.float64(50.0)

In [17]:
# 반이 1인 행의 수학 열
df[df['nclass'] == 1]['math']

0    50
1    60
2    45
3    30
Name: math, dtype: int64

In [18]:
# 반이 1인 행의 수학, 영어 열
df[df['nclass'] == 1][['math', 'english']]

   math  english
0    50       98
1    60       97
2    45       86
3    30       98

In [19]:
# pandas 함수만 사용
df.groupby('nclass') \
  .agg(math     = ('math', 'mean'),
       english  = ('english', 'mean'))

         math  english
nclass
1       46.25    94.75
2       61.25    84.25
3       35.00    98.00

In [20]:
# pandas 함수와 [] 함께 사용
df.groupby('nclass')[['math', 'english']].mean()

         math  english
nclass
1       46.25    94.75
2       61.25    84.25
3       35.00    98.00

In [21]:
df = pd.DataFrame({'var1' : [1, 2, 3,],
                   'var2' : [4, 5, 6]})
df

   var1  var2
0     1     4
1     2     5
2     3     6

In [22]:
# 인덱스 문자열 지정하기
df = pd.DataFrame({'var1' : [1, 2, 3,],
                   'var2' : [4, 5, 6]},
                   index = ['kim', 'lee', 'park'])
df

      var1  var2
kim      1     4
lee      2     5
park     3     6

In [23]:
# kim행 추출
df.loc['kim']

var1    1
var2    4
Name: kim, dtype: int64

In [24]:
# 김, 박 행 추출
df.loc[['kim', 'park']]

      var1  var2
kim      1     4
park     3     6

In [25]:
# lee행의 var1열 추출
df.loc['lee', 'var1']

np.int64(2)

In [26]:
# 김씨, 이씨 행의 var2 추출
df.loc[['kim', 'lee'], 'var2']

kim    4
lee    5
Name: var2, dtype: int64

In [27]:
df.loc[:, 'var1']

kim     1
lee     2
park    3
Name: var1, dtype: int64

In [28]:
# 인덱스 번호가 있는 데이터 프레임
df = df_row.head(10).copy()
df

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

In [29]:
# 0행 추출
df.loc[0]

id          1
nclass      1
math       50
english    98
science    50
Name: 0, dtype: int64

In [30]:
# 2행 추출
df.loc[2]

id          3
nclass      1
math       45
english    86
science    78
Name: 2, dtype: int64

In [31]:
# 시리즈로 추출
df.loc[0]

id          1
nclass      1
math       50
english    98
science    50
Name: 0, dtype: int64

In [32]:
# 데이터 프레임으로 추출
df.loc[[0]]

   id  nclass  math  english  science
0   1       1    50       98       50

In [33]:
# 1, 3, 5 행 추출
df.loc[[1, 3, 5]]

   id  nclass  math  english  science
1   2       1    60       97       60
3   4       1    30       98       58
5   6       2    50       89       98

In [34]:
# 0~3행 추출
df.loc[0:3]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [35]:
# 7~9행 추출
df.loc[7:9]

   id  nclass  math  english  science
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

In [36]:
# 0~2행 추출
df.loc[0:2]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78

In [37]:
# 첫 번째 행~2행 추출
df.loc[:2]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78

In [38]:
# 5~9행 추출
df.loc[5:9]

   id  nclass  math  english  science
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

In [39]:
# 5행 ~ 마지막 행 추출
df.loc[5:]

   id  nclass  math  english  science
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

In [40]:
# 첫 번쨰 행 ~ 마지막 행 추출
df.loc[:]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

In [41]:
df

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

In [42]:
df_label = pd.DataFrame({'var1' : [1, 2, 3,],
                         'var2' : [4, 5, 6]},
                         index = ['kim', 'lee', 'park'])
df_label

      var1  var2
kim      1     4
lee      2     5
park     3     6

In [44]:
# 인덱스 번호로 행 추출하기
df_label.loc[0]

KeyError: 0

In [45]:
# 인덱스 번호로 행 추출하기
df.loc[2, :]

id          3
nclass      1
math       45
english    86
science    78
Name: 2, dtype: int64

In [46]:
# 인덱스 번호로 열 추출하기
df.loc[:, 2]

# 에러!

KeyError: 2

In [ ]:
# 1반 추출
df.loc[df['nclass'] == 1]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [ ]:
# 수학 점수가 60점 이상이면 추출
df.loc[df['math'] >= 60]

   id  nclass  math  english  science
1   2       1    60       97       60
6   7       2    80       90       45
7   8       2    90       78       25

In [ ]:
# nclass가 1인 행의 math, english열 추출
df.loc[df['nclass'] == 1, ['math', 'english']]

   math  english
0    50       98
1    60       97
2    45       86
3    30       98

In [47]:
# 0~3행의 math열 추출
df.loc[0:3, 'math']

0    50
1    60
2    45
3    30
Name: math, dtype: int64

In [48]:
# 수학 점수가 50을 초과하는 행 추출하기
df.query('math > 50')       # df.query()
df[df['math'] > 50]         # df[]
df.loc[df['math'] > 50]     # df.loc[]

   id  nclass  math  english  science
1   2       1    60       97       60
6   7       2    80       90       45
7   8       2    90       78       25

In [49]:
# 0행 추출
df.iloc[0]

id          1
nclass      1
math       50
english    98
science    50
Name: 0, dtype: int64

In [50]:
# 2행 추출
df.iloc[2]

id          3
nclass      1
math       45
english    86
science    78
Name: 2, dtype: int64

In [51]:
# 시리즈로 추출
df.iloc[0]

id          1
nclass      1
math       50
english    98
science    50
Name: 0, dtype: int64

In [52]:
# 데이터 프레임으로 추출
df.iloc[[0]]

   id  nclass  math  english  science
0   1       1    50       98       50

In [53]:
# 1, 3, 5행 추출
df.iloc[[1, 3, 5]]

   id  nclass  math  english  science
1   2       1    60       97       60
3   4       1    30       98       58
5   6       2    50       89       98

In [54]:
df.loc[1:5] # 1~5행 추출

   id  nclass  math  english  science
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65
5   6       2    50       89       98

In [55]:
df.iloc[1:5] # 1~5행 추출

   id  nclass  math  english  science
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [56]:
df_label

      var1  var2
kim      1     4
lee      2     5
park     3     6

In [57]:
df_label.loc[0]

KeyError: 0

In [58]:
df_label.iloc[0]

var1    1
var2    4
Name: kim, dtype: int64

In [59]:
# 모든 행의 1열 추출
df.iloc[:, 1]

0    1
1    1
2    1
3    1
4    2
5    2
6    2
7    2
8    3
9    3
Name: nclass, dtype: int64

In [60]:
# 모든 행의 1, 3열 추출
df.iloc[:, [1, 3]]

   nclass  english
0       1       98
1       1       97
2       1       86
3       1       98
4       2       80
5       2       89
6       2       90
7       2       78
8       3       98
9       3       98

In [61]:
# 2행의 3열 추출
df.iloc[2, 3]

np.int64(86)

In [62]:
# 0, 1행의 2, 3열 추출
df.iloc[[0, 1], [2, 3]]

   math  english
0    50       98
1    60       97

# 17장

In [63]:
import pandas as pd
df = pd.DataFrame([1, 2, 3]) # 데이터 프레임 만들기
df.mean()   # mean() 사용

0    2.0
dtype: float64

In [64]:
x = [1, 2, 3]
sum(x) / len(x)

2.0

In [65]:
df_x = pd.DataFrame(x)
df_x.mean()

0    2.0
dtype: float64

In [66]:
x = 1
x

1

In [67]:
type(x)

int

In [68]:
x = 1.5
x

1.5

In [69]:
type(x)

float

In [70]:
x = 'apple'
x

'apple'

In [71]:
type(x)

str

In [72]:
# int 만들기
var1 = 1
var1

1

In [73]:
type(var1)

int

In [74]:
# int를 float로 바꾸기
var2 = float(var1)
var2

1.0

In [75]:
type(var2)

float

In [76]:
# float를 str로 바꾸기
var3 = str(var2)
var3

'1.0'

In [77]:
type(var3)

str

In [78]:
# 리스트 만들기
x = [1, 2, 'a', 'b']
x

[1, 2, 'a', 'b']

In [79]:
type(x)

list

In [80]:
x[0] # 0번째 값 추출

1

In [81]:
x[1:3] # 1~2번째 값 추출

[2, 'a']

In [82]:
x.append(8) # x에 8 추가
x

[1, 2, 'a', 'b', 8]

In [83]:
x.remove(2) # x에서 2 삭제
x

[1, 'a', 'b', 8]

In [84]:
x[0] = 9 # 0번째 값을 9로 변경
x

[9, 'a', 'b', 8]

In [85]:
# 튜플 만들기
x = (1, 2, 'a', 'b')
x

(1, 2, 'a', 'b')

In [86]:
type(x)

tuple

In [87]:
# () 생략하고 튜플 만들기
x2 = 1, 2, 'a', 'b'
x2

(1, 2, 'a', 'b')

In [88]:
type(x2)

tuple

In [89]:
# 0번째 값 추출
x[0]

1

In [90]:
# 1~2번째 값 추출
x[1:3]

(2, 'a')

In [91]:
x.append(8)

AttributeError: 'tuple' object has no attribute 'append'

In [92]:
x.remove(3)

AttributeError: 'tuple' object has no attribute 'remove'

In [93]:
x[0] = 9

TypeError: 'tuple' object does not support item assignment

In [94]:
# 딕셔너리 만들기
x= {'name' : 'kim'}
x

{'name': 'kim'}

In [95]:
type(x)

dict

In [96]:
x = {'id' : 1,
     'name' : ['kim', 'park'],
     'nclass' : (1, 2, 3)}
x

{'id': 1, 'name': ['kim', 'park'], 'nclass': (1, 2, 3)}

In [97]:
# id 키의 값 추출
x['id']

1

In [98]:
# name 키의 값 추출
x['name']

['kim', 'park']

In [99]:
# 키-값 쌍은 인덱스를 이용해 추출할 수 없다.
x[1]

KeyError: 1

In [100]:
# name 키의 0번째 값 추출
x['name'][0]

#딕셔너리 안에 값이 리스트로 되어 있으면 당연히 인덱스로 접근 가능한거군.

'kim'

In [101]:
# nclass 키의 1번째 값 추출
x['nclass'][1]

2

In [102]:
# 'score': [5, 6, 7] 쌍 추가
x['score'] = [5, 6, 7]
x

{'id': 1, 'name': ['kim', 'park'], 'nclass': (1, 2, 3), 'score': [5, 6, 7]}

In [103]:
# id 키:값 쌍 삭제
del(x['id'])
x

{'name': ['kim', 'park'], 'nclass': (1, 2, 3), 'score': [5, 6, 7]}

In [104]:
# name 키의 1번째 요소 삭제
del(x['name'][1])
x

{'name': ['kim'], 'nclass': (1, 2, 3), 'score': [5, 6, 7]}

In [105]:
# score 키의 값 변셩
x['score'] = [7, 8, 9]
x

{'name': ['kim'], 'nclass': (1, 2, 3), 'score': [7, 8, 9]}

In [106]:
# score 키의 2번째 값 변경
x['score'][2] = 99
x

{'name': ['kim'], 'nclass': (1, 2, 3), 'score': [7, 8, 99]}

In [107]:
# 기존 키를 새 키에 할당
x['math'] = x['score']
x

{'name': ['kim'], 'nclass': (1, 2, 3), 'score': [7, 8, 99], 'math': [7, 8, 99]}

In [108]:
# 기존 키 삭제
del(x['score'])
x

{'name': ['kim'], 'nclass': (1, 2, 3), 'math': [7, 8, 99]}

In [109]:
# 시리즈 만들기
import pandas as pd
x_num = pd.Series([3, 4, 5])
x_num

0    3
1    4
2    5
dtype: int64

In [110]:
type(x_num)

pandas.core.series.Series

In [111]:
# 인덱스 정하기
x_label = pd.Series([3, 4, 5], index = ['kim', 'lee', 'park'])
x_label

kim     3
lee     4
park    5
dtype: int64

In [112]:
# 0 번째 값 추출
x_num[0]

np.int64(3)

In [114]:
# 1 번째 값 추출
x_num[1]

np.int64(4)

In [115]:
# 인덱스 kim의 값 추출
x_label['kim']

np.int64(3)

In [116]:
x_label.loc['kim']

np.int64(3)

In [118]:
x_num.iloc[0]

np.int64(3)

In [120]:
# 인덱스 3에 9할당
x_num[3] = 9
x_num

0    3
1    4
2    5
3    9
dtype: int64

In [121]:
# 인덱스 choi에 6 할당
x_label['choi'] = 6
x_label

kim     3
lee     4
park    5
choi    6
dtype: int64

In [122]:
# 2번째 인덱스 삭제
del(x_num[2])
x_num

0    3
1    4
3    9
dtype: int64

In [124]:
# 인덱스 park 삭제
del(x_label['park'])
x_label

kim     3
lee     4
choi    6
dtype: int64

In [125]:
# 3번째 인덱스의 값을 4로 변경
x_num[3] = 4
x_num

0    3
1    4
3    4
dtype: int64

In [126]:
# 인덱스 kim의 값을 5로 변경
x_label['kim'] = 5
x_label

kim     5
lee     4
choi    6
dtype: int64

In [127]:
mpg = pd.read_csv('mpg.csv')
mpg['hwy']

0      29
1      29
2      31
3      30
4      26
       ..
229    28
230    29
231    26
232    26
233    26
Name: hwy, Length: 234, dtype: int64

In [128]:
mpg['hwy'].mean()

np.float64(23.44017094017094)

In [129]:
n_category = mpg['category'].value_counts()
n_category

category
suv           62
compact       47
midsize       41
subcompact    35
pickup        33
minivan       11
2seater        5
Name: count, dtype: int64

In [131]:
type(n_category)

pandas.core.series.Series

In [132]:
# 인덱스 번호로 추출하기
n_category[0:2]

category
suv        62
compact    47
Name: count, dtype: int64

In [133]:
# 인덱스 문자열로 추출하기
n_category[['suv', 'compact']]

category
suv        62
compact    47
Name: count, dtype: int64

In [135]:
# 데이터 프레임 만들기
df = pd.DataFrame({'var1' : [1, 2, 3],
                   'var2' : [4, 5, 6]})
df

   var1  var2
0     1     4
1     2     5
2     3     6

In [136]:
type(df)

pandas.core.frame.DataFrame

In [137]:
# 인덱스 정하기
df = pd.DataFrame({'var1' : [1, 2, 3],
                   'var2' : [4, 5, 6],},
                   index = ['kim', 'lee', 'park'])
df

      var1  var2
kim      1     4
lee      2     5
park     3     6

In [141]:
pd.DataFrame?

Init signature:
pd.DataFrame(
    data=None,
    index: 'Axes | None' = None,
    columns: 'Axes | None' = None,
    dtype: 'Dtype | None' = None,
    copy: 'bool | None' = None,
) -> 'None'
Docstring:
Two-dimensional, size-mutable, potentially heterogeneous tabular data.

Data structure also contains labeled axes (rows and columns).
Arithmetic operations align on both row and column labels. Can be
thought of as a dict-like container for Series objects. The primary
pandas data structure.

Parameters
----------
data : ndarray (structured or homogeneous), Iterable, dict, or DataFrame
    Dict can contain Series, arrays, constants, dataclass or list-like objects. If
    data is a dict, column order follows insertion-order. If a dict contains Series
    which have an index defined, it is aligned by its index. This alignment also
    occurs if data is a Series or a DataFrame itself. Alignment is done on
    Series/DataFrame inputs.

    If data is a list of dicts, column order follows insertion-order.

index : Index or array-like
    Index to use for resulting frame. Will default to RangeIndex if
    no indexing information part of input data and no index provided.
columns : Index or array-like
    Column labels to use for resulting frame when data does not have them,
    defaulting to RangeIndex(0, 1, 2, ..., n). If data contains column labels,
    will perform column selection instead.
dtype : dtype, default None
    Data type to force. Only a single dtype is allowed. If None, infer.
copy : bool or None, default None
    Copy data from inputs.
    For dict data, the default of None behaves like ``copy=True``.  For DataFrame
    or 2d ndarray input, the default of None behaves like ``copy=False``.
    If data is a dict containing one or more Series (possibly of different dtypes),
    ``copy=False`` will ensure that these inputs are not copied.

    .. versionchanged:: 1.3.0

See Also
--------
DataFrame.from_records : Constructor from tuples, also record arrays.
DataFrame.from_dict : From dicts of Series, arrays, or dicts.
read_csv : Read a comma-separated values (csv) file into DataFrame.
read_table : Read general delimited file into DataFrame.
read_clipboard : Read text from clipboard into DataFrame.

Notes
-----
Please reference the :ref:`User Guide <basics.dataframe>` for more information.

Examples
--------
Constructing DataFrame from a dictionary.

>>> d = {'col1': [1, 2], 'col2': [3, 4]}
>>> df = pd.DataFrame(data=d)
>>> df
   col1  col2
0     1     3
1     2     4

Notice that the inferred dtype is int64.

>>> df.dtypes
col1    int64
col2    int64
dtype: object

To enforce a single dtype:

>>> df = pd.DataFrame(data=d, dtype=np.int8)
>>> df.dtypes
col1    int8
col2    int8
dtype: object

Constructing DataFrame from a dictionary including Series:

>>> d = {'col1': [0, 1, 2, 3], 'col2': pd.Series([2, 3], index=[2, 3])}
>>> pd.DataFrame(data=d, index=[0, 1, 2, 3])
   col1  col2
0     0   NaN
1     1   NaN
2     2   2.0
3     3   3.0

Constructing DataFrame from numpy ndarray:

>>> df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
...                    columns=['a', 'b', 'c'])
>>> df2
   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

Constructing DataFrame from a numpy ndarray that has labeled columns:

>>> data = np.array([(1, 2, 3), (4, 5, 6), (7, 8, 9)],
...                 dtype=[("a", "i4"), ("b", "i4"), ("c", "i4")])
>>> df3 = pd.DataFrame(data, columns=['c', 'a'])
...
>>> df3
   c  a
0  3  1
1  6  4
2  9  7

Constructing DataFrame from dataclass:

>>> from dataclasses import make_dataclass
>>> Point = make_dataclass("Point", [("x", int), ("y", int)])
>>> pd.DataFrame([Point(0, 0), Point(0, 3), Point(2, 3)])
   x  y
0  0  0
1  0  3
2  2  3

Constructing DataFrame from Series/DataFrame:

>>> ser = pd.Series([1, 2, 3], index=["a", "b", "c"])
>>> df = pd.DataFrame(data=ser, index=["a", "c"])
>>> df
   0
a  1
c  3

>>> df1 = pd.DataFrame([1, 2, 3], index=["a", "b", "c"], columns=["x"])
>>> df2 = pd.DataFrame(data=df1, index=["a", "c"])
>>> df2
   x
a  1
c  3
File:           c:\data analysis\lib\site-packages\pandas\core\frame.py
Type:           type
Subclasses:     SubclassedDataFrame

In [142]:
x = [1, 1, 2, 3]
df_x = pd.DataFrame(x)
df_x

   0
0  1
1  1
2  2
3  3

In [143]:
df_x.mean()

0    1.75
dtype: float64

In [145]:
df_x.value_counts()

0
1    2
2    1
3    1
Name: count, dtype: int64

In [146]:
x1 = [1, 2, [4, 5, 6], 3]
x1

[1, 2, [4, 5, 6], 3]

In [147]:
x1[2]

[4, 5, 6]

In [148]:
x1[2][0]

4

In [149]:
nested_list   = [1, 2, (4, 5, 6), 3]
nested_tuple  = (1, 2, [4, 5, 6], 3)
nested_dict   = {'score' : {'math' : 1, 'english' : 2}}
nested_series = pd.Series([1, 2, [4, 5, 6], 3])
nested_df     = pd.DataFrame({'x' : [1, 2, [4, 5 ,6], 3]})

In [150]:
nested_df

           x
0          1
1          2
2  [4, 5, 6]
3          3